HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxQspi_bf.h
/** \\brief  Offset for Ifx_QSPI_BACON_Bits.TPRE */
#define IFX_QSPI_BACON_TPRE_OFF (13)

/** \\brief  Length for Ifx_QSPI_BACON_Bits.TRAIL */
#define IFX_QSPI_BACON_TRAIL_LEN (3)

/** \\brief  Mask for Ifx_QSPI_BACON_Bits.TRAIL */
#define IFX_QSPI_BACON_TRAIL_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_BACON_Bits.TRAIL */
#define IFX_QSPI_BACON_TRAIL_OFF (16)

/** \\brief  Length for Ifx_QSPI_BACON_Bits.UINT */
#define IFX_QSPI_BACON_UINT_LEN (1)

/** \\brief  Mask for Ifx_QSPI_BACON_Bits.UINT */
#define IFX_QSPI_BACON_UINT_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_BACON_Bits.UINT */
#define IFX_QSPI_BACON_UINT_OFF (20)

/** \\brief  Length for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_LEN (32)

/** \\brief  Mask for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_MSK (0xffffffff)

/** \\brief  Offset for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_OFF (0)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.CS */
#define IFX_QSPI_BACONPWM_CS_LEN (4)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.CS */
#define IFX_QSPI_BACONPWM_CS_MSK (0xf)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.CS */
#define IFX_QSPI_BACONPWM_CS_OFF (28)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.DL */
#define IFX_QSPI_BACONPWM_DL_LEN (5)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.DL */
#define IFX_QSPI_BACONPWM_DL_MSK (0x1f)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.DL */
#define IFX_QSPI_BACONPWM_DL_OFF (23)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.IDLE */
#define IFX_QSPI_BACONPWM_IDLE_LEN (3)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.IDLE */
#define IFX_QSPI_BACONPWM_IDLE_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.IDLE */
#define IFX_QSPI_BACONPWM_IDLE_OFF (4)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.IPRE */
#define IFX_QSPI_BACONPWM_IPRE_LEN (3)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.IPRE */
#define IFX_QSPI_BACONPWM_IPRE_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.IPRE */
#define IFX_QSPI_BACONPWM_IPRE_OFF (1)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.LEAD */
#define IFX_QSPI_BACONPWM_LEAD_LEN (3)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.LEAD */
#define IFX_QSPI_BACONPWM_LEAD_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.LEAD */
#define IFX_QSPI_BACONPWM_LEAD_OFF (10)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.LPRE */
#define IFX_QSPI_BACONPWM_LPRE_LEN (3)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.LPRE */
#define IFX_QSPI_BACONPWM_LPRE_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.LPRE */
#define IFX_QSPI_BACONPWM_LPRE_OFF (7)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.MSB */
#define IFX_QSPI_BACONPWM_MSB_LEN (1)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.MSB */
#define IFX_QSPI_BACONPWM_MSB_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.MSB */
#define IFX_QSPI_BACONPWM_MSB_OFF (21)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.PARTYP */
#define IFX_QSPI_BACONPWM_PARTYP_LEN (1)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.PARTYP */
#define IFX_QSPI_BACONPWM_PARTYP_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.PARTYP */
#define IFX_QSPI_BACONPWM_PARTYP_OFF (19)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.TPRE */
#define IFX_QSPI_BACONPWM_TPRE_LEN (3)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.TPRE */
#define IFX_QSPI_BACONPWM_TPRE_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.TPRE */
#define IFX_QSPI_BACONPWM_TPRE_OFF (13)

/** \\brief  Length for Ifx_QSPI_BACONPWM_Bits.TRAIL */
#define IFX_QSPI_BACONPWM_TRAIL_LEN (3)

/** \\brief  Mask for Ifx_QSPI_BACONPWM_Bits.TRAIL */
#define IFX_QSPI_BACONPWM_TRAIL_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_BACONPWM_Bits.TRAIL */
#define IFX_QSPI_BACONPWM_TRAIL_OFF (16)

/** \\brief  Length for Ifx_QSPI_CLC_Bits.DISR */
#define IFX_QSPI_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_QSPI_CLC_Bits.DISR */
#define IFX_QSPI_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_CLC_Bits.DISR */
#define IFX_QSPI_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_QSPI_CLC_Bits.DISS */
#define IFX_QSPI_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_QSPI_CLC_Bits.DISS */
#define IFX_QSPI_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_CLC_Bits.DISS */
#define IFX_QSPI_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_QSPI_CLC_Bits.EDIS */
#define IFX_QSPI_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_QSPI_CLC_Bits.EDIS */
#define IFX_QSPI_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_CLC_Bits.EDIS */
#define IFX_QSPI_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_LEN (32)

/** \\brief  Mask for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_MSK (0xffffffff)

/** \\brief  Offset for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_OFF (0)

/** \\brief  Length for Ifx_QSPI_ECON_Bits.A */
#define IFX_QSPI_ECON_A_LEN (2)

/** \\brief  Mask for Ifx_QSPI_ECON_Bits.A */
#define IFX_QSPI_ECON_A_MSK (0x3)

/** \\brief  Offset for Ifx_QSPI_ECON_Bits.A */
#define IFX_QSPI_ECON_A_OFF (6)

/** \\brief  Length for Ifx_QSPI_ECON_Bits.B */
#define IFX_QSPI_ECON_B_LEN (2)

/** \\brief  Mask for Ifx_QSPI_ECON_Bits.B */
#define IFX_QSPI_ECON_B_MSK (0x3)

/** \\brief  Offset for Ifx_QSPI_ECON_Bits.B */
#define IFX_QSPI_ECON_B_OFF (8)

/** \\brief  Length for Ifx_QSPI_ECON_Bits.C */
#define IFX_QSPI_ECON_C_LEN (2)

/** \\brief  Mask for Ifx_QSPI_ECON_Bits.C */
#define IFX_QSPI_ECON_C_MSK (0x3)

/** \\brief  Offset for Ifx_QSPI_ECON_Bits.C */
#define IFX_QSPI_ECON_C_OFF (10)

/** \\brief  Length for Ifx_QSPI_ECON_Bits.CPH */
#define IFX_QSPI_ECON_CPH_LEN (1)

/** \\brief  Mask for Ifx_QSPI_ECON_Bits.CPH */
#define IFX_QSPI_ECON_CPH_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_ECON_Bits.CPH */
#define IFX_QSPI_ECON_CPH_OFF (12)

/** \\brief  Length for Ifx_QSPI_ECON_Bits.CPOL */
#define IFX_QSPI_ECON_CPOL_LEN (1)

/** \\brief  Mask for Ifx_QSPI_ECON_Bits.CPOL */
#define IFX_QSPI_ECON_CPOL_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_ECON_Bits.CPOL */
#define IFX_QSPI_ECON_CPOL_OFF (13)

/** \\brief  Length for Ifx_QSPI_ECON_Bits.PAREN */
#define IFX_QSPI_ECON_PAREN_LEN (1)

