HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxQspi_bf.h
/** \\brief  Mask for Ifx_QSPI_ECON_Bits.PAREN */
#define IFX_QSPI_ECON_PAREN_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_ECON_Bits.PAREN */
#define IFX_QSPI_ECON_PAREN_OFF (14)

/** \\brief  Length for Ifx_QSPI_ECON_Bits.Q */
#define IFX_QSPI_ECON_Q_LEN (6)

/** \\brief  Mask for Ifx_QSPI_ECON_Bits.Q */
#define IFX_QSPI_ECON_Q_MSK (0x3f)

/** \\brief  Offset for Ifx_QSPI_ECON_Bits.Q */
#define IFX_QSPI_ECON_Q_OFF (0)

/** \\brief  Length for Ifx_QSPI_FLAGSCLEAR_Bits.ERRORCLEARS */
#define IFX_QSPI_FLAGSCLEAR_ERRORCLEARS_LEN (9)

/** \\brief  Mask for Ifx_QSPI_FLAGSCLEAR_Bits.ERRORCLEARS */
#define IFX_QSPI_FLAGSCLEAR_ERRORCLEARS_MSK (0x1ff)

/** \\brief  Offset for Ifx_QSPI_FLAGSCLEAR_Bits.ERRORCLEARS */
#define IFX_QSPI_FLAGSCLEAR_ERRORCLEARS_OFF (0)

/** \\brief  Length for Ifx_QSPI_FLAGSCLEAR_Bits.HC1C */
#define IFX_QSPI_FLAGSCLEAR_HC1C_LEN (1)

/** \\brief  Mask for Ifx_QSPI_FLAGSCLEAR_Bits.HC1C */
#define IFX_QSPI_FLAGSCLEAR_HC1C_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_FLAGSCLEAR_Bits.HC1C */
#define IFX_QSPI_FLAGSCLEAR_HC1C_OFF (13)

/** \\brief  Length for Ifx_QSPI_FLAGSCLEAR_Bits.HC2C */
#define IFX_QSPI_FLAGSCLEAR_HC2C_LEN (1)

/** \\brief  Mask for Ifx_QSPI_FLAGSCLEAR_Bits.HC2C */
#define IFX_QSPI_FLAGSCLEAR_HC2C_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_FLAGSCLEAR_Bits.HC2C */
#define IFX_QSPI_FLAGSCLEAR_HC2C_OFF (14)

/** \\brief  Length for Ifx_QSPI_FLAGSCLEAR_Bits.PT1C */
#define IFX_QSPI_FLAGSCLEAR_PT1C_LEN (1)

/** \\brief  Mask for Ifx_QSPI_FLAGSCLEAR_Bits.PT1C */
#define IFX_QSPI_FLAGSCLEAR_PT1C_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_FLAGSCLEAR_Bits.PT1C */
#define IFX_QSPI_FLAGSCLEAR_PT1C_OFF (11)

/** \\brief  Length for Ifx_QSPI_FLAGSCLEAR_Bits.PT2C */
#define IFX_QSPI_FLAGSCLEAR_PT2C_LEN (1)

/** \\brief  Mask for Ifx_QSPI_FLAGSCLEAR_Bits.PT2C */
#define IFX_QSPI_FLAGSCLEAR_PT2C_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_FLAGSCLEAR_Bits.PT2C */
#define IFX_QSPI_FLAGSCLEAR_PT2C_OFF (12)

/** \\brief  Length for Ifx_QSPI_FLAGSCLEAR_Bits.RXC */
#define IFX_QSPI_FLAGSCLEAR_RXC_LEN (1)

/** \\brief  Mask for Ifx_QSPI_FLAGSCLEAR_Bits.RXC */
#define IFX_QSPI_FLAGSCLEAR_RXC_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_FLAGSCLEAR_Bits.RXC */
#define IFX_QSPI_FLAGSCLEAR_RXC_OFF (10)

/** \\brief  Length for Ifx_QSPI_FLAGSCLEAR_Bits.TXC */
#define IFX_QSPI_FLAGSCLEAR_TXC_LEN (1)

/** \\brief  Mask for Ifx_QSPI_FLAGSCLEAR_Bits.TXC */
#define IFX_QSPI_FLAGSCLEAR_TXC_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_FLAGSCLEAR_Bits.TXC */
#define IFX_QSPI_FLAGSCLEAR_TXC_OFF (9)

/** \\brief  Length for Ifx_QSPI_FLAGSCLEAR_Bits.USRC */
#define IFX_QSPI_FLAGSCLEAR_USRC_LEN (1)

/** \\brief  Mask for Ifx_QSPI_FLAGSCLEAR_Bits.USRC */
#define IFX_QSPI_FLAGSCLEAR_USRC_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_FLAGSCLEAR_Bits.USRC */
#define IFX_QSPI_FLAGSCLEAR_USRC_OFF (15)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.ERRORENS */
#define IFX_QSPI_GLOBALCON1_ERRORENS_LEN (9)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.ERRORENS */
#define IFX_QSPI_GLOBALCON1_ERRORENS_MSK (0x1ff)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.ERRORENS */
#define IFX_QSPI_GLOBALCON1_ERRORENS_OFF (0)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.HC1EN */
#define IFX_QSPI_GLOBALCON1_HC1EN_LEN (1)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.HC1EN */
#define IFX_QSPI_GLOBALCON1_HC1EN_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.HC1EN */
#define IFX_QSPI_GLOBALCON1_HC1EN_OFF (13)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.HC2EN */
#define IFX_QSPI_GLOBALCON1_HC2EN_LEN (1)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.HC2EN */
#define IFX_QSPI_GLOBALCON1_HC2EN_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.HC2EN */
#define IFX_QSPI_GLOBALCON1_HC2EN_OFF (14)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.PT1 */
#define IFX_QSPI_GLOBALCON1_PT1_LEN (3)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.PT1 */
#define IFX_QSPI_GLOBALCON1_PT1_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.PT1 */
#define IFX_QSPI_GLOBALCON1_PT1_OFF (20)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.PT1EN */
#define IFX_QSPI_GLOBALCON1_PT1EN_LEN (1)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.PT1EN */
#define IFX_QSPI_GLOBALCON1_PT1EN_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.PT1EN */
#define IFX_QSPI_GLOBALCON1_PT1EN_OFF (11)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.PT2 */
#define IFX_QSPI_GLOBALCON1_PT2_LEN (3)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.PT2 */
#define IFX_QSPI_GLOBALCON1_PT2_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.PT2 */
#define IFX_QSPI_GLOBALCON1_PT2_OFF (23)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.PT2EN */
#define IFX_QSPI_GLOBALCON1_PT2EN_LEN (1)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.PT2EN */
#define IFX_QSPI_GLOBALCON1_PT2EN_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.PT2EN */
#define IFX_QSPI_GLOBALCON1_PT2EN_OFF (12)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.PWMVIOEN */
#define IFX_QSPI_GLOBALCON1_PWMVIOEN_LEN (1)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.PWMVIOEN */
#define IFX_QSPI_GLOBALCON1_PWMVIOEN_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.PWMVIOEN */
#define IFX_QSPI_GLOBALCON1_PWMVIOEN_OFF (30)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.RXEN */
#define IFX_QSPI_GLOBALCON1_RXEN_LEN (1)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.RXEN */
#define IFX_QSPI_GLOBALCON1_RXEN_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.RXEN */
#define IFX_QSPI_GLOBALCON1_RXEN_OFF (10)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.RXFIFOINT */
#define IFX_QSPI_GLOBALCON1_RXFIFOINT_LEN (2)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.RXFIFOINT */
#define IFX_QSPI_GLOBALCON1_RXFIFOINT_MSK (0x3)

/** \\brief  Offset for Ifx_QSPI_GLOBALCON1_Bits.RXFIFOINT */
#define IFX_QSPI_GLOBALCON1_RXFIFOINT_OFF (18)

/** \\brief  Length for Ifx_QSPI_GLOBALCON1_Bits.RXFM */
#define IFX_QSPI_GLOBALCON1_RXFM_LEN (2)

/** \\brief  Mask for Ifx_QSPI_GLOBALCON1_Bits.RXFM */
#define IFX_QSPI_GLOBALCON1_RXFM_MSK (0x3)

