HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxQspi_bf.h
/** \\brief  Mask for Ifx_QSPI_INJECT_Bits.INJECT */
#define IFX_QSPI_INJECT_INJECT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_QSPI_INJECT_Bits.INJECT */
#define IFX_QSPI_INJECT_INJECT_OFF (0)

/** \\brief  Length for Ifx_QSPI_KRST0_Bits.RST */
#define IFX_QSPI_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_QSPI_KRST0_Bits.RST */
#define IFX_QSPI_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_KRST0_Bits.RST */
#define IFX_QSPI_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_QSPI_KRST0_Bits.RSTSTAT */
#define IFX_QSPI_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_QSPI_KRST0_Bits.RSTSTAT */
#define IFX_QSPI_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_KRST0_Bits.RSTSTAT */
#define IFX_QSPI_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_QSPI_KRST1_Bits.RST */
#define IFX_QSPI_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_QSPI_KRST1_Bits.RST */
#define IFX_QSPI_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_KRST1_Bits.RST */
#define IFX_QSPI_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_QSPI_MASK_Bits.MASK */
#define IFX_QSPI_MASK_MASK_LEN (32)

/** \\brief  Mask for Ifx_QSPI_MASK_Bits.MASK */
#define IFX_QSPI_MASK_MASK_MSK (0xffffffff)

/** \\brief  Offset for Ifx_QSPI_MASK_Bits.MASK */
#define IFX_QSPI_MASK_MASK_OFF (0)

/** \\brief  Length for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_LEN (32)

/** \\brief  Mask for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_MSK (0xffffffff)

/** \\brief  Offset for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_OFF (0)

/** \\brief  Length for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_QSPI_PISEL_Bits.MRIS */
#define IFX_QSPI_PISEL_MRIS_LEN (3)

/** \\brief  Mask for Ifx_QSPI_PISEL_Bits.MRIS */
#define IFX_QSPI_PISEL_MRIS_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_PISEL_Bits.MRIS */
#define IFX_QSPI_PISEL_MRIS_OFF (0)

/** \\brief  Length for Ifx_QSPI_PISEL_Bits.SCIS */
#define IFX_QSPI_PISEL_SCIS_LEN (3)

/** \\brief  Mask for Ifx_QSPI_PISEL_Bits.SCIS */
#define IFX_QSPI_PISEL_SCIS_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_PISEL_Bits.SCIS */
#define IFX_QSPI_PISEL_SCIS_OFF (8)

/** \\brief  Length for Ifx_QSPI_PISEL_Bits.SLSIS */
#define IFX_QSPI_PISEL_SLSIS_LEN (3)

/** \\brief  Mask for Ifx_QSPI_PISEL_Bits.SLSIS */
#define IFX_QSPI_PISEL_SLSIS_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_PISEL_Bits.SLSIS */
#define IFX_QSPI_PISEL_SLSIS_OFF (12)

/** \\brief  Length for Ifx_QSPI_PISEL_Bits.SRIS */
#define IFX_QSPI_PISEL_SRIS_LEN (3)

/** \\brief  Mask for Ifx_QSPI_PISEL_Bits.SRIS */
#define IFX_QSPI_PISEL_SRIS_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_PISEL_Bits.SRIS */
#define IFX_QSPI_PISEL_SRIS_OFF (4)

/** \\brief  Length for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_LEN (32)

/** \\brief  Mask for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_MSK (0xffffffff)

/** \\brief  Offset for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_OFF (0)

/** \\brief  Length for Ifx_QSPI_SSOC_Bits.AOL */
#define IFX_QSPI_SSOC_AOL_LEN (16)

/** \\brief  Mask for Ifx_QSPI_SSOC_Bits.AOL */
#define IFX_QSPI_SSOC_AOL_MSK (0xffff)

/** \\brief  Offset for Ifx_QSPI_SSOC_Bits.AOL */
#define IFX_QSPI_SSOC_AOL_OFF (0)

/** \\brief  Length for Ifx_QSPI_SSOC_Bits.OEN */
#define IFX_QSPI_SSOC_OEN_LEN (16)

/** \\brief  Mask for Ifx_QSPI_SSOC_Bits.OEN */
#define IFX_QSPI_SSOC_OEN_MSK (0xffff)

/** \\brief  Offset for Ifx_QSPI_SSOC_Bits.OEN */
#define IFX_QSPI_SSOC_OEN_OFF (16)

/** \\brief  Length for Ifx_QSPI_STATUS1_Bits.BITCOUNT */
#define IFX_QSPI_STATUS1_BITCOUNT_LEN (8)

/** \\brief  Mask for Ifx_QSPI_STATUS1_Bits.BITCOUNT */
#define IFX_QSPI_STATUS1_BITCOUNT_MSK (0xff)

/** \\brief  Offset for Ifx_QSPI_STATUS1_Bits.BITCOUNT */
#define IFX_QSPI_STATUS1_BITCOUNT_OFF (0)

/** \\brief  Length for Ifx_QSPI_STATUS1_Bits.MPWMVIO */
#define IFX_QSPI_STATUS1_MPWMVIO_LEN (2)

/** \\brief  Mask for Ifx_QSPI_STATUS1_Bits.MPWMVIO */
#define IFX_QSPI_STATUS1_MPWMVIO_MSK (0x3)

/** \\brief  Offset for Ifx_QSPI_STATUS1_Bits.MPWMVIO */
#define IFX_QSPI_STATUS1_MPWMVIO_OFF (9)

/** \\brief  Length for Ifx_QSPI_STATUS1_Bits.MTVIO */
#define IFX_QSPI_STATUS1_MTVIO_LEN (2)

/** \\brief  Mask for Ifx_QSPI_STATUS1_Bits.MTVIO */
#define IFX_QSPI_STATUS1_MTVIO_MSK (0x3)

/** \\brief  Offset for Ifx_QSPI_STATUS1_Bits.MTVIO */
#define IFX_QSPI_STATUS1_MTVIO_OFF (12)

/** \\brief  Length for Ifx_QSPI_STATUS1_Bits.PWMVIO */
#define IFX_QSPI_STATUS1_PWMVIO_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS1_Bits.PWMVIO */
#define IFX_QSPI_STATUS1_PWMVIO_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS1_Bits.PWMVIO */
#define IFX_QSPI_STATUS1_PWMVIO_OFF (8)

/** \\brief  Length for Ifx_QSPI_STATUS1_Bits.TVIO */
#define IFX_QSPI_STATUS1_TVIO_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS1_Bits.TVIO */
#define IFX_QSPI_STATUS1_TVIO_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS1_Bits.TVIO */
#define IFX_QSPI_STATUS1_TVIO_OFF (11)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.ERRORFLAGS */
#define IFX_QSPI_STATUS_ERRORFLAGS_LEN (9)

