HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxQspi_bf.h
/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.ERRORFLAGS */
#define IFX_QSPI_STATUS_ERRORFLAGS_MSK (0x1ff)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.ERRORFLAGS */
#define IFX_QSPI_STATUS_ERRORFLAGS_OFF (0)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.HC1F */
#define IFX_QSPI_STATUS_HC1F_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.HC1F */
#define IFX_QSPI_STATUS_HC1F_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.HC1F */
#define IFX_QSPI_STATUS_HC1F_OFF (13)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.HC2F */
#define IFX_QSPI_STATUS_HC2F_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.HC2F */
#define IFX_QSPI_STATUS_HC2F_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.HC2F */
#define IFX_QSPI_STATUS_HC2F_OFF (14)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.PHASE */
#define IFX_QSPI_STATUS_PHASE_LEN (4)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.PHASE */
#define IFX_QSPI_STATUS_PHASE_MSK (0xf)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.PHASE */
#define IFX_QSPI_STATUS_PHASE_OFF (28)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.PT1F */
#define IFX_QSPI_STATUS_PT1F_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.PT1F */
#define IFX_QSPI_STATUS_PT1F_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.PT1F */
#define IFX_QSPI_STATUS_PT1F_OFF (11)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.PT2F */
#define IFX_QSPI_STATUS_PT2F_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.PT2F */
#define IFX_QSPI_STATUS_PT2F_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.PT2F */
#define IFX_QSPI_STATUS_PT2F_OFF (12)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.RPV */
#define IFX_QSPI_STATUS_RPV_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.RPV */
#define IFX_QSPI_STATUS_RPV_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.RPV */
#define IFX_QSPI_STATUS_RPV_OFF (26)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.RXF */
#define IFX_QSPI_STATUS_RXF_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.RXF */
#define IFX_QSPI_STATUS_RXF_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.RXF */
#define IFX_QSPI_STATUS_RXF_OFF (10)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.RXFIFOLEVEL */
#define IFX_QSPI_STATUS_RXFIFOLEVEL_LEN (3)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.RXFIFOLEVEL */
#define IFX_QSPI_STATUS_RXFIFOLEVEL_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.RXFIFOLEVEL */
#define IFX_QSPI_STATUS_RXFIFOLEVEL_OFF (19)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.SLAVESEL */
#define IFX_QSPI_STATUS_SLAVESEL_LEN (4)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.SLAVESEL */
#define IFX_QSPI_STATUS_SLAVESEL_MSK (0xf)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.SLAVESEL */
#define IFX_QSPI_STATUS_SLAVESEL_OFF (22)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.TPV */
#define IFX_QSPI_STATUS_TPV_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.TPV */
#define IFX_QSPI_STATUS_TPV_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.TPV */
#define IFX_QSPI_STATUS_TPV_OFF (27)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.TXF */
#define IFX_QSPI_STATUS_TXF_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.TXF */
#define IFX_QSPI_STATUS_TXF_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.TXF */
#define IFX_QSPI_STATUS_TXF_OFF (9)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.TXFIFOLEVEL */
#define IFX_QSPI_STATUS_TXFIFOLEVEL_LEN (3)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.TXFIFOLEVEL */
#define IFX_QSPI_STATUS_TXFIFOLEVEL_MSK (0x7)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.TXFIFOLEVEL */
#define IFX_QSPI_STATUS_TXFIFOLEVEL_OFF (16)

/** \\brief  Length for Ifx_QSPI_STATUS_Bits.USRF */
#define IFX_QSPI_STATUS_USRF_LEN (1)

/** \\brief  Mask for Ifx_QSPI_STATUS_Bits.USRF */
#define IFX_QSPI_STATUS_USRF_MSK (0x1)

/** \\brief  Offset for Ifx_QSPI_STATUS_Bits.USRF */
#define IFX_QSPI_STATUS_USRF_OFF (15)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXQSPI_BF_H */
